In [2]:
import pandas as pd

In [3]:
space_org = {'Organisation_name' : ['ISRO','NASA','JAXA','CNSA','CNESS'],
             'Headquarters' : ['Banglore','Washington','Tokyo','Beijing','Paris'],
             'Country': ['India','USA','Japan','China','France'],
             'Formation Year': [1969,1958,2003,1998,1961] }

In [4]:
space_org_df = pd.DataFrame(space_org)

In [5]:
space_org_df

  Organisation_name Headquarters Country  Formation Year
0              ISRO     Banglore   India            1969
1              NASA   Washington     USA            1958
2              JAXA        Tokyo   Japan            2003
3              CNSA      Beijing   China            1998
4             CNESS        Paris  France            1961

In [7]:
for row in space_org_df.itertuples():
    print(row)

Pandas(Index=0, Organisation_name='ISRO', Headquarters='Banglore', Country='India', _4=1969)
Pandas(Index=1, Organisation_name='NASA', Headquarters='Washington', Country='USA', _4=1958)
Pandas(Index=2, Organisation_name='JAXA', Headquarters='Tokyo', Country='Japan', _4=2003)
Pandas(Index=3, Organisation_name='CNSA', Headquarters='Beijing', Country='China', _4=1998)
Pandas(Index=4, Organisation_name='CNESS', Headquarters='Paris', Country='France', _4=1961)

In [8]:
for row in space_org_df.iterrows():
    print(row)

(0, Organisation_name        ISRO
Headquarters         Banglore
Country                 India
Formation Year           1969
Name: 0, dtype: object)
(1, Organisation_name          NASA
Headquarters         Washington
Country                     USA
Formation Year             1958
Name: 1, dtype: object)
(2, Organisation_name     JAXA
Headquarters         Tokyo
Country              Japan
Formation Year        2003
Name: 2, dtype: object)
(3, Organisation_name       CNSA
Headquarters         Beijing
Country                China
Formation Year          1998
Name: 3, dtype: object)
(4, Organisation_name     CNESS
Headquarters          Paris
Country              France
Formation Year         1961
Name: 4, dtype: object)

In [10]:
for row_index,row in space_org_df.iterrows():
    print(row_index)
    print(row)

0
Organisation_name        ISRO
Headquarters         Banglore
Country                 India
Formation Year           1969
Name: 0, dtype: object
1
Organisation_name          NASA
Headquarters         Washington
Country                     USA
Formation Year             1958
Name: 1, dtype: object
2
Organisation_name     JAXA
Headquarters         Tokyo
Country              Japan
Formation Year        2003
Name: 2, dtype: object
3
Organisation_name       CNSA
Headquarters         Beijing
Country                China
Formation Year          1998
Name: 3, dtype: object
4
Organisation_name     CNESS
Headquarters          Paris
Country              France
Formation Year         1961
Name: 4, dtype: object

In [11]:
for key,item in space_org_df.iteritems():
    print('Key Value :',key)
    print(item)

Key Value : Organisation_name
0     ISRO
1     NASA
2     JAXA
3     CNSA
4    CNESS
Name: Organisation_name, dtype: object
Key Value : Headquarters
0      Banglore
1    Washington
2         Tokyo
3       Beijing
4         Paris
Name: Headquarters, dtype: object
Key Value : Country
0     India
1       USA
2     Japan
3     China
4    France
Name: Country, dtype: object
Key Value : Formation Year
0    1969
1    1958
2    2003
3    1998
4    1961
Name: Formation Year, dtype: int64

In [12]:
for values in space_org_df.iteritems():
    print(values)

('Organisation_name', 0     ISRO
1     NASA
2     JAXA
3     CNSA
4    CNESS
Name: Organisation_name, dtype: object)
('Headquarters', 0      Banglore
1    Washington
2         Tokyo
3       Beijing
4         Paris
Name: Headquarters, dtype: object)
('Country', 0     India
1       USA
2     Japan
3     China
4    France
Name: Country, dtype: object)
('Formation Year', 0    1969
1    1958
2    2003
3    1998
4    1961
Name: Formation Year, dtype: int64)